tutorials/compressible/nexaFoam/heatBath_generic/constant/speciesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      speciesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


N2
{
    specie
    {
        molWeight       28.01348; // g.m^(-3)
        type            atomic;
    }
    thermodynamics
    {
    TAbsLow            200; // K
    TAbsHigh           20000; // K
    TFirstInt          1000; // K
    TSecondInt         6000; // K
    ThetaVibrational   3371; // K
    highCpCoeffs
    (
        8.310139160e+08
        -6.420733540e+05
        2.020264635e+02
        -3.065092046e-02
        2.486903333e-06
        -9.705954110e-11
        1.437538881e-15
        4.938707040e+06
        -1.672099740e+03
    );
    midCpCoeffs
    (
        5.877124060e+05
        -2.239249073e+03
        6.066949220e+00
        -6.139685500e-04
        1.491806679e-07
        -1.923105485e-11
        1.061954386e-15
        1.283210415e+04
        -1.586640027e+01
    );
    lowCpCoeffs
    (
        2.210371497e+04
        -3.818461820e+02
        6.082738360e+00
        -8.530914410e-03
        1.384646189e-05
        -9.625793620e-09
        2.519705809e-12
        7.108460860e+02
        -1.076003744e+01
    );
    }
    // M. Lalande, N. Dellinger, Y. Prevereaud, N. Bartoli, and J-M. Lamet, "Blottner’s Coefficients and Prandtl Number for Charring Materials Atmospheric Entry Simulations", AIAA Journal, 63(8), 2025.
    transport // Valid 200-30000 K
    {
        AB              2.7321e-02;
        BB              2.4321e-01;
        CB              -1.0805e+01;
        //Pr            0.7020; // Valid 200-10000 K
    }
}


O2
{
    specie
    {
        molWeight       31.9988; // g.m^(-3)
        type            atomic;
    }
    // B. J. McBride, M. J. Zehe, and S. Gordon, "NASA Glenn Coefficients for Calculating Thermodynamic Properties of Individual Species", NASA/TP-2002-211556, 2002.
    thermodynamics
    {
        TAbsLow            200; // K
        TAbsHigh           20000; // K
        TFirstInt          1000; // K
        TSecondInt         6000; // K
        ThetaVibrational   2256; // K
        highCpCoeffs
        (
            4.975294300e+08
            -2.866106874e+05
            6.690352250e+01
            -6.169959020e-03
            3.016396027e-07
            -7.421416600e-12
            7.278175770e-17
            2.293554027e+06
            -5.530621610e+02
        );
        midCpCoeffs
        (
            -1.037939022e+06
            2.344830282e+03
            1.819732036e+00
            1.267847582e-03
            -2.188067988e-07
            2.053719572e-11
            -8.193467050e-16
            -1.689010929e+04
            1.738716506e+01
        );
        lowCpCoeffs
        (
            -3.425563420e+04
            4.847000970e+02
            1.119010961e+00
            4.293889240e-03
            -6.836300520e-07
            -2.023372700e-09
            1.039040018e-12
            -3.391454870e+03
            1.849699470e+01
        );
    }
    // M. Lalande, N. Dellinger, Y. Prevereaud, N. Bartoli, and J-M. Lamet, "Blottner’s Coefficients and Prandtl Number for Charring Materials Atmospheric Entry Simulations", AIAA Journal, 63(8), 2025.
    transport // Valid 200-30000 K
    {
        AB              2.6757e-02;
        BB              2.5401e-01;
        CB              -1.0711e+01;
        //Pr            0.7051; // Valid 200-10000 K
    }
}

/*
// N
mixture
{
    specie
    {
        molWeight       14.0067; // g.m^(-3)
        type            atomic;
    }
    // B. J. McBride, M. J. Zehe, and S. Gordon, "NASA Glenn Coefficients for Calculating Thermodynamic Properties of Individual Species", NASA/TP-2002-211556, 2002.
    thermodynamics
    {
        TAbsLow            200; // K
        TAbsHigh           20000; // K
        TFirstInt          1000; // K
        TSecondInt         6000; // K
        ThetaVibrational   0; // K
        highCpCoeffs
        (
            5.475181050e+08
            -3.107574980e+05
            6.916782740e+01
            -6.847988130e-03
            3.827572400e-07
            -1.098367709e-11
            1.277986024e-16
            2.550585618e+06
            -5.848769753e+02
        );
        midCpCoeffs
        (
            8.876501380e+04
            -1.071231500e+02
            2.362188287e+00
            2.916720081e-04
            -1.729515100e-07
            4.012657880e-11
            -2.677227571e-15
            5.697351330e+04
            4.865231506e+00
        );
        lowCpCoeffs
        (
            0.000000000e+00 
            0.000000000e+00
            2.500000000e+00
            0.000000000e+00
            0.000000000e+00
            0.000000000e+00
            0.000000000e+00
            5.610463780e+04
            4.193905036e+00
        );
    }
    // M. Lalande, N. Dellinger, Y. Prevereaud, N. Bartoli, and J-M. Lamet, "Blottner’s Coefficients and Prandtl Number for Charring Materials Atmospheric Entry Simulations", AIAA Journal, 63(8), 2025.
    transport // Valid 200-30000 K
    {
        AB              2.4768e-02;
        BB              2.8672e-01;
        CB              -1.0976e+01;
        //Pr            0.8133; // Valid 200-10000 K
    }
}*/
/*
// O
mixture
{
    specie
    {
        molWeight       15.9994; // g.m^(-3)
        type            atomic;
    }
    // B. J. McBride, M. J. Zehe, and S. Gordon, "NASA Glenn Coefficients for Calculating Thermodynamic Properties of Individual Species", NASA/TP-2002-211556, 2002.
    thermodynamics
    {
        TAbsLow            200; // K
        TAbsHigh           20000; // K
        TFirstInt          1000; // K
        TSecondInt         6000; // K
        ThetaVibrational   0; // K
        highCpCoeffs
        (
            1.779004264e+08
            -1.082328257e+05
            2.810778365e+01
            -2.975232262e-03
            1.854997534e-07
            -5.796231540e-12
            7.191720164e-17
            8.890942630e+05
            -2.181728151e+02
        );
        midCpCoeffs
        (
            2.619020262e+05
            -7.298722030e+02
            3.317177270e+00
            -4.281334360e-04
            1.036104594e-07
            -9.438304330e-12
            2.725038297e-16
            3.392428060e+04
            -6.679585350e-01
        );
        lowCpCoeffs
        (
            -7.953611300e+03
            1.607177787e+02
            1.966226438e+00
            1.013670310e-03
            -1.110415423e-06
            6.517507500e-10
            -1.584779251e-13
            2.840362437e+04
            8.404241820e+00
        );
    }
    // M. Lalande, N. Dellinger, Y. Prevereaud, N. Bartoli, and J-M. Lamet, "Blottner’s Coefficients and Prandtl Number for Charring Materials Atmospheric Entry Simulations", AIAA Journal, 63(8), 2025.
    transport // Valid 200-30000 K
    {
        AB              2.7230e-02;
        BB              2.3976e-01;
        CB              -1.0383e+01;
        //Pr            0.7053; // Valid 200-10000 K
    }
}*/
/*
// NO
mixture
{
    specie
    {
        molWeight       30.0061; // g.m^(-3)
        type            molecular;
    }
    // B. J. McBride, M. J. Zehe, and S. Gordon, "NASA Glenn Coefficients for Calculating Thermodynamic Properties of Individual Species", NASA/TP-2002-211556, 2002.
    thermodynamics
    {
        TAbsLow            200; // K
        TAbsHigh           20000; // K
        TFirstInt          1000; // K
        TSecondInt         6000; // K
        ThetaVibrational   2719; // K
        highCpCoeffs
        (
            -9.575303540e+08
            5.912434480e+05
            -1.384566826e+02
            1.694339403e-02
            -1.007351096e-06
            2.912584076e-11
            -3.295109350e-16
            -4.677501240e+06
            1.242081216e+03
        );
        midCpCoeffs
        (
            2.239018716e+05
            -1.289651623e+03
            5.433936030e+00
            -3.656034900e-04
            9.880966450e-08
            -1.416076856e-11
            9.380184620e-16
            1.750317656e+04
            -8.501669090e+00
        );
        lowCpCoeffs
        (
            -1.143916503e+04
            1.536467592e+02
            3.431468730e+00
            -2.668592368e-03
            8.481399120e-06
            -7.685111050e-09
            2.386797655e-12
            9.098214410e+03
            6.728725490e+00
        );
    }
    // M. Lalande, N. Dellinger, Y. Prevereaud, N. Bartoli, and J-M. Lamet, "Blottner’s Coefficients and Prandtl Number for Charring Materials Atmospheric Entry Simulations", AIAA Journal, 63(8), 2025.
    transport // Valid 200-30000 K
    {
        AB              2.7227e-02;
        BB              2.4463e-01;
        CB              -1.0776e+01;
        //Pr            0.7132; // Valid 200-10000 K
    }
}*/

// ************************************************************************* //
