tutorials/compressible/nexaFoam/heatBath_generic/0/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      initialConditions;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

TTRValue  300;
TVibValue 300;

pressureValue  1;

velocityValue  (0 0 0);

N2_mol_fraction 0;
O2_mol_fraction 1;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
